---
type: FamilyParameterSet
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# FamilyParameterSet

`Autodesk.Revit.DB.FamilyParameterSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FamilyParameterSet | — | `public FamilyParameterSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( FamilyParameter item )` |
| Method | Erase | — | `public virtual int Erase ( FamilyParameter item )` |
| Method | ForwardIterator | — | `public virtual FamilyParameterSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( FamilyParameter item )` |
| Method | ReverseIterator | — | `public virtual FamilyParameterSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |